import greenfoot.*;  

/**
 * Screen that shows the game controllers
 */
public class HowToPlayScreen extends Screen
{
    public HowToPlayScreen()
    {    
        showText("Στόχος σου είναι να νικήσεις όλες τις δυνάμεις των Περσών\n" +
        "Επέλεξε κάθε μονάδα χωριστά κάνοντας πάνω της κλικ\n" + 
        "για να διατάξεις την κίνησή της.\n" +
        "Επάνω βέλος - η μονάδα κινείται προς τα ΕΜΠΡΟΣ\n" +
        "Κάτω βέλος - η μονάδα κινείται προς τα ΠΙΣΩ\n" +
        "Αριστερό βέλος - η μονάδα περιστρέφεται προς τα ΑΡΙΣΤΕΡΑ\n" +
        "Δεξί βέλος - η μονάδα περιστρέφεται προς τα ΔΕΞΙΑ\n"+
        "Backspace - η μονάδα ακινητοποιείται\n\n" +
        "!!!ΠΡΟΣΟΧΗ!!!\n" +
        "Οι μονάδες όσο πολεμούν χάνουν ζωή.\n" +
        "Σκέψου πως θα τις βάλεις να πολεμήσουν.\n" + 
        "Αν πεθάνει ο Αλέξανδρος τότε αυτόματα χάνεται η μάχη!\n"+
        "Να δίνεις σημασία στις συμβουλές πάνω αριστερά στον χάρτη!" ,getWidth()/2, getHeight()/3);
        addObject(new BackButton(), (getWidth()/2 + 80), (getHeight()/2 + 200));
    }
}
