import greenfoot.*;

/**
 * Depending the level which the player is, is displays the appropriate
 * screen and buttons. Sets the game level approprietly.
 */
public class StoryScreen extends Screen
{
    public StoryScreen()
    {    
        switch(GameStats.level){
            case 0: showText("Ο Αλέξανδρος ξεκίνησε την εκστρατεία του το καλοκάιρι του\n" + 
                            "334 πΧ. Η πρώτη του δοκιμασία ενάντια στους Πέρσες ήταν να\n" +
                            "έρθει σύντομα. Με την απόβασή του στην Μικρά Ασία, ο Μέμνων\n" +
                            "από την Ρόδο, Έλληνας Σατράπης των Περσών, συγκεντρωσε\n"+
                            "στρατό στον Γρανικό ποταμό για να αντιμετωπίσει γρήγορα\n" +
                            "την ελληνική απειλή. Οι Πέρσες συγκεντρωσαν βαρύ ιππικό\n" +
                            "και Έλληνες μισθοφόρους. Ο Αλέξανδρος δίχως να χάσει\n" +
                            "χρόνο ετοιμάζει τον στρατό του για μάχη.\n",getWidth()/2, getHeight()/2);
            GameStats.level = 1;
            addObject(new StartButton(), (getWidth()/2 + 80), (getHeight()/2 + 200));
            break;
            case 1: showText("Ο Αλέξανδρος νίκησε με ευκολία τις δυνάμεις των Περσών\n" + 
                             "και συνέχισε με την απελευθέρωση των Ελληνικών πόλεων\n" +
                             "της Μ. Ασίας. Ο βασιλιάς των Περσών Δαρείος ο Γ',\n" +
                             "αντιλήφθηκε την σημαντικότητα του προβλήματος και\n" +
                             "ξεκίνησε να μαζέυει στρατό. Οι δυο βασιλιάδες ήθραν\n" +
                             "αντιμέτωποι λίγο πιο έξω από την πόλη της Ισσού,\n" +
                             "στην Κιλικία της Μ. Ασίας το 333πΧ. Ο Αλέξανδρος\n" +
                             "πρέπει να νικήσει τον Δαρείο προκειμένου να συνεχίσει\n"+
                             "προς την Μέση Ανατολή.",getWidth()/2, getHeight()/2);
            GameStats.level = 2;
            addObject(new StartButton(), (getWidth()/2 + 80), (getHeight()/2 + 200));
            break;
            case 2: showText("Ο Αλέξανδρος κάνοντας έξυπνο ελιγμό με το ιππικό\n" + 
                             "έτρεψε τον Δαρείο και τον στρατό του σε φυγή. Μετά την\n" +
                             "Ο βασιλιάς των Περσών Δαρείος ο Γ', αντιλ΄φθηκε την σημαντικότητα\n" +
                             "του προβλήματος και ξεκίνησε να μαζέυει στρατό. Οι δυο βασιλιάδες\n" +
                             "ήθραν αντιμέτωποι λίγο 331πΧ πιο έξω από την πόλη της Ισσού, Στην Κιλικία της\n" +
                             "Μ. Ασίας. Ο Αλέξανδρος πρέπει να νικήσει τον Δαρείο προκειμένου να συνεχίσει προς την Μέση\n" +
                             "Ανατολή.\n",getWidth()/2, getHeight()/2);
            GameStats.level = 3;
            addObject(new StartButton(), (getWidth()/2 + 80), (getHeight()/2 + 200));
            break;
            case 3: showText("Με την νίκη επί των Περσών ο Αλεξ μπορούσε ελέυθερα να κατευθυνθεί προς την Βαβυλώνα",getWidth()/2, getHeight()/2);
            addObject(new ReturnToMenuButton(), (getWidth() + 80), (getHeight()/2 + 200));
            break;
        }
    }
}
