import greenfoot.*;

/**
 * Depending the level which the player is, is displays the appropriate
 * screen and buttons. Sets the game level approprietly.
 */
public class StoryScreen extends Screen
{
    public StoryScreen()
    {    
        switch(GameStats.level){
            case 0: showText("Ο Αλέξανδρος ξεκίνησε την εκστρατεία του το καλοκάιρι του\n" + 
            "323 πΧ. Η πρώτη του δοκιμασία ενάντια στους Πέρσες ήταν να έρθει σύντομα\n" +
            "Με την απόβασή του στην Μικρά Ασία, ο Μέμνων από την Ρόδο, Έλληνας Σατράπης\n" +
            "των Περσών, συγκεντρωσε στρατό στον Γρανικό ποταμό για να αντιμετωπίσει\n" +
            "γρήγορα την ελληνική απειλή. Οι Πέρσες συγκεντρωσαν βαρύ ιππικό και\n" +
            "Έλληνες μισθοφόρους. Ο Αλέξανδρος δίχως να χάσει χρόνο ετοιμάζει τον στρατό\n" +
            "του για μάχη.\n",getWidth()/2, getHeight()/2);
            GameStats.level = 1;
            addObject(new StartButton(), getWidth()/2, (getHeight()/2 + 200));
            break;
            case 1: showText("Ο Αλέξανδρος νίκησε με ευκολία τις δυνάμεις των Παερσών\n" + 
            "κια συνέχισε με την απελευθέρωση των Ελληνικών πόλεων της Μ. Ασίας.\n" +
            "Ο βασιλιάς των Περσών Δαρείος ο Γ', αντιλ΄φθηκε την σημαντικότητα\n" +
            "του προβλήματος και ξεκίνησε να μαζέυει στρατό. Οι δυο βασιλιάδες\n" +
            "ήθραν αντιμέτωποι λίγο πιο έξω από την πόλη της Ισσού, Στην Κιλικία της\n" +
            "Μ. Ασίας. Ο Αλέξανδρος πρέπει να νικήσει τον Δαρείο προκειμένου να συνεχίσει προς την Μέση\n" +
            "Ανατολή.\n",getWidth()/2, getHeight()/2);
            GameStats.level = 2;
            addObject(new StartButton(), getWidth()/2, (getHeight()/2 + 200));
            break;
            case 2: showText("Ο Αλέξανδρος κάνοντας έξυπνο ελιγμό με το ιππικό\n" + 
            "έτρεψε τον Δαρείο και τον στρατό του σε φυγή Τύρος, Γάζα, Αίγυπτος.\n" +
            "Ο βασιλιάς των Περσών Δαρείος ο Γ', αντιλ΄φθηκε την σημαντικότητα\n" +
            "του προβλήματος και ξεκίνησε να μαζέυει στρατό. Οι δυο βασιλιάδες\n" +
            "ήθραν αντιμέτωποι λίγο πιο έξω από την πόλη της Ισσού, Στην Κιλικία της\n" +
            "Μ. Ασίας. Ο Αλέξανδρος πρέπει να νικήσει τον Δαρείο προκειμένου να συνεχίσει προς την Μέση\n" +
            "Ανατολή.\n",getWidth()/2, getHeight()/2);
            GameStats.level = 3;
            addObject(new StartButton(), getWidth()/2, (getHeight()/2 + 200));
            break;
            case 3: showText("Με την νίκη επί των Περσών ο Αλεξ μπορούσε ελέυθερα να κατευθυνθεί προς την Βαβυλώνα",getWidth()/2, getHeight()/2);
            addObject(new ReturnToMenuButton(), getWidth()/2, (getHeight()/2 + 200));
            break;
        }
    }
}
